[{
	"id": "SFA810",
	"description": "This fund is to provide scholarships to academically at risk students who have at least a 2.0 GPA and meet Florida Atlantic University’s acceptance requirements and who have graduated from public high schools in Deerfield Beach. This scholarship is to provide incentives for at risk students to avoid criminal activities and to promote a lifestyle to enhance opportunities to excel and pursue crime free futures."
}, {
	"id": "SFA999",
	"description": "The Adam Jay Harris Memorial Scholarship was established in memory of former FAU pre-med student, Adam Jay Harris. Recipients must be full-time undergraduates with a minimum 3.0 GPA and pursuing a pre-med course of study"
}, {
	"id": "SFA150",
	"description": "Scholarship recipients in any major must demonstrate a combination of outstanding academic achievement and financial need. A completed FAFSA is required to be considered for this scholarship."
}, {
	"id": "SFA590",
	"description": "The Albert Allister Endowed Scholarship was established as a result of a matured annuity for Albert Allister. Recipients must be in good standing at FAU. "
}, {
	"id": "SFA050",
	"description": "This scholarship is awarded to qualified children and grandchildren of FAU alumni (former students who have earned at least 32 credit hours at the University). The applicants must be enrolled as sophomores, juniors, seniors or graduate students at FAU and have at least a 3.0 cumulative GPA. Preference will be given to students who demonstrate financial need. A completed FAFSA is required to be considered for this scholarship. "
}, {
	"id": "SFA370",
	"description": "The Angelos Langadas Scholarship is for deserving students who are making progress with education. Preference will be given to students of Greek heritage with a demonstrated financial need. A completed FAFSA is required to be considered for this scholarship. "
}, {
	"id": "SFA035",
	"description": "To provide scholarship awards to students in good standing at FAU. The recipients must have demonstrated financial need. A completed FAFSA is required to be considered for this scholarship. "
}, {
	"id": "COLSCH",
	"description": "The Coca Cola Scholarship is awarded to 1st bachelor undergraduate students ONLY who are U.S. citizens or resident aliens, in a degree-seeking program who are enrolled at least half-time, demonstrate financial need and who have a GPA of 2.5 or higher. Entering freshman students are also eligible. With the application, submit a letter of recommendation from an academic advisor, faculty member, instructor or principal. A completed FAFSA is required to be considered for this scholarship."
}, {
	"id": "SFA060",
	"description": "The award is given to a student who demonstrates leadership capabilities and financial need. The recipient must be enrolled full time with a minimum 2.5 cumulative GPA. A completed FAFSA is required to be considered for this scholarship. "
}, {
	"id": "SFA355",
	"description": "Awarded to students in good academic standing who demonstrate financial need. A completed FAFSA is required to be considered for this scholarship."
}, {
	"id": "SFA861",
	"description": "The award is created for financially worthy students. Recipients must be in good academic standing and degree seeking at FAU, with demonstrated financial need. A completed FAFSA is required to be considered for this scholarship. "
}, {
	"id": "SFA025",
	"description": "This purpose of the Eleanor R. Baldwin Scholarship is to provide support to students in the FAU College of Education. Preference will be given to undergraduate students enrolled in student teaching in the upcoming academic year and have a minimum 3.2 GPA. Graduate students enrolled in the College of Education with a minimum 3.5 GPA are also eligible to apply. Students will be awarded on the basis of merit with consideration given to scholarship, leadership and leadership potential in the field of education and then for financial need. A completed FAFSA is required to be considered for this scholarship. "
}, {
	"id": "SFA170",
	"description": "This award is available to a full-time student with a minimum 3.0 cumulative GPA who demonstrates financial need. Preference is given to U.S. born African Americans or American Indians. This scholarship is not available to students in the College of Education. A completed FAFSA is required to be considered for this scholarship.  "
}, {
	"id": "SFA900",
	"description": "This scholarship is awarded to students with demonstrated financial need. All applicants must have attended a public, private or parochial high school in Palm Beach County. A completed FAFSA is required to be considered for this scholarship. "
}, {
	"id": "MEMSCH",
	"description": "This scholarship is established to memorialize students who have passed away during the academic year. Applicants must be enrolled in the same college as the memorialized student.   Recipient must also have at least a 2.5 GPA and demonstrated financial need. A completed FAFSA is required to be considered for this scholarship. All applicants must upload or include a letter or recommendation from an FAU advisor or Faculty member"
}, {
	"id": "SFA950",
	"description": "This scholarship is awarded with preference given to a female of Asian descent. Recipient must have a minimum GPA of 3.5, be in good standing at FAU, and have demonstrated financial need. A completed FAFSA is required to be considered for this scholarship.  "
}, {
	"id": "SFA890",
	"description": "This fund was established to help support an undergraduate or graduate student enrolled in a minimum of 9 credits. First preference will be given to US military veterans having served active duty or the child of an active duty member of the US military. Second preference will be given to a child of a firefighter or police officer killed in the line of duty. Please include all pertinent information.  "
}, {
	"id": "SFA910",
	"description": "The Helen O'Leary Scholarship provides support to undergraduate and graduate students at FAU with demonstrated financial need. A completed FAFSA is required to be considered for this scholarship.  "
}, {
	"id": "SFA500",
	"description": "This scholarship is for a student from Ft. Lauderdale with a major in the School of Science, Business, Engineering, and attends full time, with at least a 3.0 GPA."
}, {
	"id": "BUSSCH",
	"description": "This scholarship is for degree seeking graduate students.  Preference will be given to former members of FAU's football team followed by members of FAU women's athletic teams.  Additional preferences will be given to graduate students seeking a degree in the College of Business."
}, {
	"id": "SFA440",
	"description": "The Weiss scholarship was established to provide support to students whose life experience or family challenges make higher education opportunities difficult, or students who have unexpected financial needs or unusual circumstances that arise during the year and impact the students education. Students must have a minimum 2.5 GPA and demonstrated financial need. Along with this application an essay is required explaining financial situations, career goals and special accomplishments including how the student has overcome obstacles in life. A completed FAFSA is required to be considered for this scholarship.  "
}, {
	"id": "SFA840",
	"description": "This scholarship is intended to provide assistance for students who could not otherwise get an education at FAU. Students seeking undergraduate and graduate degrees in the areas of Business, Science, Biomedical, Nursing, Education, Engineering/Computer Science, Architecture, Urban and Public Affairs will be eligible to apply. Students must be Florida residents, maintain a minimum 3.0 GPA and demonstrate financial need as required by the FAU Office of Student Financial Aid. A completed FAFSA is required to be considered for this scholarship."
}, {
	"id": "SFA020",
	"description": "The Kay Lioy/FAU Club Scholarship is awarded to an FAU employee or his/her spouse or child who is enrolled at least half time, demonstrates financial need and maintains a 2.0 GPA. A completed FAFSA is required to be considered for this scholarship.  "
}, {
	"id": "SFA529",
	"description": "This scholarship was established by Lillian Delmarter because she never had the opportunity to complete her formal education; her goal is to help students with the ability to experience the joys of learning. Student must demonstrate financial need. A completed FAFSA is required to be considered for this scholarship.  "
}, {
	"id": "SFA930",
	"description": "This scholarship is given to a deserving, full-time undergraduate student with demonstrated financial need. A completed FAFSA is required to be considered for this scholarship. "
}, {
	"id": "SFA871",
	"description": "The scholarship requires students to be enrolled as undergraduates or graduates with demonstrated financial need and a minimum GPA of 3.25. A completed FAFSA is required to be considered for this scholarship. "
}, {
	"id": "SFA360",
	"description": "The purpose of this scholarship is to provide awards for students in the areas of architecture, ocean engineering or pharmaceutical studies. Recipients must be in their junior or senior year and demonstrate financial need. Scholarship may be renewed for one year. A completed FAFSA is required to be considered for this scholarship. "
}, {
	"id": "SFA210",
	"description": "This scholarship is awarded to a student who is a sophomore, junior or senior with demonstrated financial need. Award is renewable upon application. A completed FAFSA is required to be considered for this scholarship."
}, {
	"id": "SFA220",
	"description": "This scholarship is to support students who have shown leadership potential by obtaining the rank of Eagle Scout via the Boy Scouts of America. It is also for \"Returning\" undergraduate students, 25 years or older, who are returning to college after an absence of two or more years. Students must have a GPA of 3.0 or greater and demonstrate financial need. A completed FAFSA is required to be considered for this scholarship."
}, {
	"id": "SKPSCH",
	"description": "This scholarship will be awarded to two undergraduate students (minimum GPA of 3.0), and two graduate students, (minimum GPA of 3.0), who have extensive leadership accomplishments and have demonstrated commitment to civic duty via participation in student activities. "
}, {
	"id": "SFA785",
	"description": "This scholarship is for currently enrolled students who are also employees of St. Andrews Estates. Students who have worked at SAEN at least 90 days and are attending FAU are eligible to apply for this scholarship. Students must have a 3.0 GPA and be recommended by the SAEN culinary director. Recipients must continue working at SAEN a minimum of 192 hours per semester while in school under this scholarship. "
}, {
	"id": "SGASCH",
	"description": "This scholarship is awarded to a student who is enrolled at least half-time, seeking a 4-year or graduate degree, has at least a 2.5 GPA, and is a U.S. Citizen or permanent resident. Applicant must also provide a letter of recommendation from an instructor, employer or advisor. The letter must be the original and CURRENT and not from a relative. UWC members and Student Government member receiving tuition reimbursements are ineligible."
}, {
	"id": "SFA710",
	"description": "The scholarship was established in honor of Thomas F. Fleming Jr., the late founder and chairman of the Foundation Board. This scholarship will be awarded to students enrolled in the College of Arts and Letters or enrolled in the College of Education for 2016-2017.  The eligible majors are:  Communication Sciences and Disorders, Counselor Education, Curriculum, Culture and Education Inquiry, Educational Leadership, Exceptional Student Education, Exercise Science and Health Promotion. Teaching and Learning, Anthropology, Communication and Multimedia Studies, English, History, Music, Philosophy, Political Science, Sociology, Theater and Dance, Visual Arts and Art History, Women, Gender and Sexuality Studies, Languages, Linguistics and Comparative Literature."
}, {
	"id": "SFA100",
	"description": "This scholarship is for students who are 25 years or older and have demonstrated financial need. The recipient must be enrolled at least half time either as undergraduate or graduate student. A completed FAFSA is required to be considered for this scholarship."
}, {
	"id": "ADV996",
	"description": "Established in 2014 by FAU President John Kelly and First Lady Carolyn Kelly, the Kelly Family Scholarship Fund will help make the dream of higher education a reality for some of FAU's most deserving students. Generous gifts to this fund will be matched dollar for dollar by President and Mrs. Kelly. Undergraduates and graduates who apply must in be in good academic standing with demonstrated financial need. A completed FAFSA is required to be considered for this scholarship."
}, {
	"id": "DENSCH",
	"description": "The Diversity Enhancement Scholarship for Transfers (DEST) is a competitive program, for qualified minority (American Indian or Alaska Native, Asian, Black or African American, Hispanic or Latino, Native Hawaiian or Other Pacific Islander) transfer students. The scholarship is awarded on the basis of financial need, academic merit, both need/merit, and other select criteria. Students must be Florida residents, degree-seeking, enrolled full-time, and adhere to the application guidelines in order to qualify for full consideration. A completed FAFSA is required to be considered for this scholarship."
}, {
	"id": "SFA455",
	"description": "To provide scholarships to full or part time employees at Edgewater Pointe Estates. Applicants must be employed with Edgewater Pointe Estates no less than 90 days. Must be working 12 or more hours weekly. Undergraduate students must have a minimum GPA of 2.75. Graduate students must have a minimum.  GPA of 3.0."
}, {
	"id": "SFA140",
	"description": "The Rotary Club of Boca Raton has established this scholarship to provide educational or research opportunities to students of Florida Atlantic University. Scholarship recipients will be determined in  accordance with the following criteria: must have attended high school in Palm Beach County, must be  degree-seeking undergraduate attending FAU at least half-time (6 credits), have a minimum 2.5 GPA,  demonstrated a strong commitment to community service, have a completed FAFSA and demonstrated  financial need, and be willing to participate in a mentorship program administered by the Boca Raton Rotary Club. "
}, {
	"id": "SFA041",
	"description": "This scholarship is awarded to qualified children and grandchildren of FAU current, retired and emeritus faculty and staff. Applicants must have a 3.0 GPA and be enrolled as a sophomore, junior, senior or graduate student. Preference will be given to students who demonstrate financial need. A completed FAFSA is required to be considered for this scholarship."
}, {
	"id": "SFA520",
	"description": "This scholarship is given to a deserving student who demonstrates financial need. Preference is given to students of Asian heritage."
}, {
	"id": "RGESCH",
	"description": "The Rolling Green Elementary School Scholarship is open to any FAU student that is a current or former faculty, staff, or student at Rolling Green Elementary School or current or former faculty or staff of Crosspointe Elementary School. "
}, {
	"id": "MBGSCH",
	"description": "Awards to first-time-in-college freshmen majoring in one of the following areas: anthropology, criminal justice, economics, geography, health administration, political science, social work or sociology. Renewable up to four years based on academic achievement and completion in one of the areas above"
}, {
	"id": "MLKSCH",
	"description": "Awards for first-time-in-college freshmen who meet the academic requirements for admission to FAU and demonstrate financial need. Renewable up to eight consecutive semesters based on academic achievement. To meet eligibility, students must complete the Free Application for Federal Student Aid (FAFSA) and have a minimum score of 1450 SAT (all three sections) or a 21 ACT. "
}, {
	"id": "BOASCH",
	"description": "Awards for first-time-in-college freshmen. Students must demonstrate financial need; please complete the Free Application for Federal Student Aid (FAFSA) to determine eligibility. Recipient must demonstrate a history of community service and have a minimum 3.3 GPA. Award will be evenly divided between fall and spring terms. The student must maintain continuous enrollment, and scholarship eligibility for a maximum of eight semesters."
}, {
	"id": "TEASCH",
	"description": "Awards for incoming junior transfer students from one of Florida’s College System institutions. Students must have a minimum 3.0 GPA and demonstrate financial need. Available for part-time and full-time students Renewable up to five semesters or upon completion of Undergraduate Degree."
}, {
	"id": "SFA055",
	"description": "The Snell Family Scholarship Fund will be used to support three individual scholarship awards of up to $10,000 per student for one year. The scholarship awards may be used for tuition and fees as well as books associated with the recipient's education. To be eligible for this scholarship students must: demonstrate financial need, be enrolled full time (minimum of 12 credit hours per semester), be a Florida resident, and maintain a 3.0 cumulative GPA."
}, {
	"id": "SFA085",
	"description": "The Gabor Agency Scholarship will be awarded on an annual basis to a student or students at FAU whose parents are currently members of FAU faculty or staff, are maintaining at least a 3.0 cumulative GPA, and have a stated and demonstrated interest in an area of study. "
}]