[
  {
    "id": "ADV785",
    "category_ref": 1,
    "url": "",
    "deadline": null,
    "limit": 0,
    "name": "St. Andrews Estates North & Evelyn and Stanford King Scholarship",
    "description": "This scholarship is for students who have a high school senior GPA of 3.0+, are accepted for enrollment in and meet the scholarship criteria of FAU. Applicants must have worked at SAEN for at least 90 days, have a recommendation from the SAEN Culinary Department Director, and must continue working at SAEN for a minimum of 192 hours per semester while in school under this scholarship.",
    "active": true
  },
  {
    "id": "ADV996",
    "category_ref": 1,
    "name": "The Kelly Family Scholarship",
    "url": "",
    "description": "Established in 2014 by FAU President John Kelly and First Lady Carolyn Kelly, the Kelly Family Scholarship Fund will help make the dream of higher education a reality for some of FAU's most deserving students. Generous gifts to this fund will be matched dollar for dollar by President and Mrs. Kelly. Undergraduates and graduates who apply must in be in good academic standing with demonstrated financial need. A completed FAFSA is required to be considered for this scholarship.",
    "deadline": null,
    "limit": 300,
    "active": true
  },
  {
    "id": "ADV998",
    "category_ref": 1,
    "url": "",
    "deadline": null,
    "limit": 0,
    "name": "President's Challenge Scholarship",
    "description": "This scholarship is open to students in good academic standing at FAU who have financial need.",
    "active": false
  },
  {
    "id": "SFA365",
    "category_ref": 1,
    "name": "Bank of America Florida's Community Scholars Program",
    "url": "",
    "description": "Awards for first-time-in-college freshmen. Students must demonstrate financial need; please complete the Free Application for Federal Student Aid (FAFSA) to determine eligibility. Recipient must demonstrate a history of community service and have a minimum 3.3 GPA. Award will be evenly divided between fall and spring terms. The student must maintain continuous enrollment, and scholarship eligibility for a maximum of eight semesters.",
    "deadline": null,
    "limit": 300,
    "active": false
  },
  {
    "id": "BUS836",
    "category_ref": 1,
    "url": "",
    "deadline": null,
    "limit": 0,
    "name": "Florida Grocery Manufacturers Scholarship",
    "description": "This scholarship is for the fulltime student who is a Junior, Senior or Graduate Business major with a 3.0 and above GPA. Students must be in good standing with University. Students are encouraged to attend one of Florida grocery Manufacturer's Association network events.",
    "active": false
  },
  {
    "id": "BUSSCH",
    "category_ref": 1,
    "name": "Guggenheim Scholarship",
    "url": "",
    "description": "The Guggenheim Scholarship is awarded to degree seeking students pursuing a graduate degree. Preference will be given to former FAU athletic students, with priority given to former members of the FAU football team, followed by former members of FAU's women's athletic teams. Additional preference will be given to graduate students seeking a degree in the College of Business.",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "SFA240",
    "category_ref": 1,
    "name": "Coca Cola Scholarship",
    "url": "",
    "description": "The Coca-Cola Scholarship is awarded to students enrolled in a degree seeking program or in a teacher certification program, registered at least half-time and demonstrate financial need. Applicants must have either a minimum 2.5 GPA or be an incoming freshman. A letter of recommendation from an academic advisor, faculty member, instructor or principal is required. A completed FAFSA is required to be considered for this scholarship.",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "DENSCH",
    "category_ref": 1,
    "name": "Diversity Enhancement Scholarship for Transfers",
    "url": "http://www.fau.edu/finaid/pdf/scholarships/Diversity%20Enhancement%20Scholarship.docx",
    "description": "The Diversity Enhancement Scholarship for Transfers (DEST) is a competitive program, for qualified minority (American Indian or Alaska Native, Asian, Black or African American, Hispanic or Latino, Native Hawaiian or Other Pacific Islander) transfer students. The scholarship is awarded on the basis of financial need, academic merit, both need/merit, and other select criteria. Students must be Florida residents, degree-seeking, enrolled full-time, and adhere to the application guidelines in order to qualify for full consideration. A completed FAFSA is required to be considered for this scholarship. Click the link above to download the application.",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "SFA125",
    "category_ref": 1,
    "name": "Deborah 'Mikki' Minney Minority Scholarship",
    "url": "",
    "description": "This scholarship is provided to undergraduate students with special consideration for 'First Generation' students who are members of an underrepresented group. Preference will be given to African Americans, then to Native Americans or Hispanics or Caribbean Americans.",
    "deadline": null,
    "limit": 100,
    "active": true
  },
  {
    "id": "EXT001",
    "category_ref": 1,
    "name": "The Military and Veteran Student Scholarship ",
    "url": "http://www.fau.edu/finaid/pdf/scholarships/The%20Military%20and%20Veteran%20Student%20Scholarship%20Application.docx",
    "description": "Reserved for Honorably discharged veterans, current military service members from all branches, spouse or dependent of an honorably discharged veteran or current serviceman/woman who meet the following criteria: Minimum GPA of: 2.5 (Undergraduate); 3.0 (Graduate); Pass/Successful (Graduate) and who have exhausted all VA educational benefits and/or do not receive enough benefits to cover the cost of attendance. Please submit completed application to the Financial Aid Office.",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "SFA290",
    "category_ref": 1,
    "name": "M. Brenn Green Scholarship",
    "url": "",
    "description": "The M. Brenn Green Scholarship awards first-time-in-college freshmen majoring in one of the following areas: Anthropology, Criminal Justice, Economics, Geography, Health Administration, Political Science, Social Work, or Sociology. It is renewable up to four years based on academic achievement and completion in one of the areas above",
    "deadline": null,
    "limit": 300,
    "active": false
  },
  {
    "id": "MEMSCH",
    "category_ref": 1,
    "name": "FAU Memorial Scholarship",
    "url": "",
    "description": "This scholarship is established to memorialize students who have passed away during the academic year. Applicants must be enrolled in the same college as the memorialized student. Recipient must also have at least a 2.5 GPA and demonstrated financial need. A completed FAFSA is required to be considered for this scholarship. All applicants must upload or include a letter or recommendation from an FAU advisor or Faculty member.",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "MLKSCH",
    "category_ref": 1,
    "name": "Martin Luther King Jr. Award",
    "url": "",
    "description": "The Martin Luther King Jr. Award is for first-time-in-college freshmen who meet the academic requirements for admission to FAU and demonstrate financial need. Renewable up to eight consecutive semesters based on academic achievement. To be eligible, students must complete the Free Application for Federal Student Aid (FAFSA) and have a minimum score of 1450 SAT (all three sections) or a 21 ACT.",
    "deadline": null,
    "limit": 300,
    "active": false
  },
  {
    "id": "RGESCH",
    "category_ref": 1,
    "name": "Rolling Green Elementary School Scholarship",
    "url": "",
    "description": "The Rolling Green Elementary School Scholarship is open to any FAU student that is currently or has been a faculty or staff member of Rolling Green Elementary School or Crosspointe Elementary School. It is also open to former students of Rolling Green Elementary School. ",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "SFA010",
    "category_ref": 1,
    "url": "",
    "deadline": null,
    "limit": 0,
    "name": "Chick-fil-a Scholarship",
    "description": "The Chick-fil-a Scholarship is awarded to FAU students that are employed at either the Town Center Chick-fil-a or FAU on-campus Chick-fil-a.",
    "active": false
  },
  {
    "id": "SFA020",
    "category_ref": 1,
    "name": "Kay S. Lioy/FAU club Scholarship",
    "url": "",
    "description": "The Kay S. Lioy/FAU Club Scholarship is given to an FAU employee, their spouse, or their child so long as they are enrolled at least half time, demonstrate financial need, and maintain a 2.0 GPA. A completed FAFSA is required to be considered for this scholarship.",
    "deadline": null,
    "limit": 100,
    "active": true
  },
  {
    "id": "SFA025",
    "category_ref": 1,
    "name": "Eleanor R. Baldwin Endowment Fund",
    "url": "",
    "description": "The Eleanor R. Baldwin Endowment Fund supports students in the FAU College of Education. Preference will be given to undergraduate students enrolled in student teaching in the upcoming academic year and have a minimum 3.2 GPA. Graduate students enrolled in the College of Education with a minimum GPA of 3.5 are also eligible to apply. Students will be awarded on the basis of merit with consideration given to scholarship, leadership, and leadership potential in the field of education, and then for financial need. A completed FAFSA is required to be considered for this scholarship.",
    "deadline": null,
    "limit": 300,
    "active": true
  },
  {
    "id": "SFA035",
    "category_ref": 1,
    "name": "Arnold and Ruth Greenberg Scholarship Fund",
    "url": "",
    "description": "The Arnold and Ruth Greenberg Scholarship is awarded to assist students in good standing at FAU, based on demonstrated financial need. A completed FAFSA is required to be considered for this scholarship.",
    "deadline": null,
    "limit": 200,
    "active": true
  },
  {
    "id": "SFA041",
    "category_ref": 1,
    "name": "David & Sandy Lowe Faculty & Staff Legacy Scholarship",
    "url": "",
    "description": "This scholarship is awarded to qualified children and grandchildren of FAU current, retired and emeritus faculty and staff. Applicants must have a 3.0 GPA and be enrolled as a sophomore, junior, senior or graduate student. Preference will be given to students who demonstrate financial need. A completed FAFSA is required to be considered for this scholarship.",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "SFA050",
    "category_ref": 1,
    "name": "Alumni Legacy Scholarship",
    "url": "",
    "description": "This scholarship is awarded to qualified children and grandchildren of FAU alumni (former students who have earned at least 32 credit hours at the University). The applicants must be enrolled as sophomores, juniors, seniors, or graduate students at FAU and have at least a 3.0 cumulative GPA. Preference will be given to students who demonstrate financial need. A completed FAFSA is required to be considered for this scholarship.",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "SFA055",
    "category_ref": 1,
    "name": "Snell Family Scholarship Fund",
    "url": "",
    "description": "The Snell Family Scholarship Fund will be used to support three individual scholarship awards of up to $10,000 per student for one year. The scholarship awards may be used for tuition and fees as well as books associated with the recipient's education. To be eligible for this scholarship students must demonstrate financial need, be enrolled full time (minimum of 12 credit hours per semester), be a Florida resident, and maintain a 3.0 cumulative GPA.",
    "deadline": null,
    "limit": 300,
    "active": true
  },
  {
    "id": "SFA060",
    "category_ref": 1,
    "name": "Daniel A. & Martha F. Mica Scholarship Endowment",
    "url": "",
    "description": "The Daniel A & Martha F. Mica Scholarship Endowment is given to a student who demonstrates leadership capabilities and financial need. The recipient must be enrolled full time with a minimum 2.5 cumulative GPA. A completed FAFSA is required to be considered for this scholarship.",
    "deadline": null,
    "limit": 200,
    "active": true
  },
  {
    "id": "SFA085",
    "category_ref": 1,
    "name": "Gabor Agency Scholarship",
    "url": "",
    "description": "The Gabor Agency Scholarship will be awarded on an annual basis to students at FAU whose parents are currently members of FAU faculty or staff, are maintaining at least a 3.0 GPA, and have a stated and demonstrated interest in an area of study. A completed FAFSA is required to be considered for this scholarship.",
    "deadline": null,
    "limit": 300,
    "active": true
  },
  {
    "id": "SFA100",
    "category_ref": 1,
    "name": "Woodford Zimmerman Memorial Scholarship Endowment",
    "url": "",
    "description": "The Woodford Zimmerman Memorial Scholarship Endowment is awarded to students 25 years or older with demonstrated financial need. The selected recipient must be enrolled at least half time either as an undergraduate or graduate student. A completed FAFSA is required to be considered for this scholarship.",
    "deadline": null,
    "limit": 100,
    "active": true
  },
  {
    "id": "SFA140",
    "category_ref": 1,
    "name": "Rotary Club of Boca Raton Scholarship",
    "url": "",
    "description": "The Rotary Club of Boca Raton has established this scholarship to provide educational or research opportunities to students of Florida Atlantic University. Scholarship recipients must have attended high school in Palm Beach County, must be a degree-seeking undergraduate attending FAU at least half-time (6 credits), have a minimum 2.5 GPA, demonstrated a strong commitment to community service, have a completed FAFSA, demonstrate financial need, and be willing to participate in a mentorship program administered by the Boca Raton Rotary Club.",
    "deadline": null,
    "limit": 250,
    "active": true
  },
  {
    "id": "SFA150",
    "category_ref": 1,
    "name": "Adelaide R. & Joseph G. Snyder Scholarship",
    "url": "",
    "description": "The Adelaide R. & Joseph G. Snyder Scholarship is given to a full-time student who demonstrates outstanding academic achievement and financial need. A completed FAFSA is required to be considered for this scholarship.",
    "deadline": null,
    "limit": 100,
    "active": true
  },
  {
    "id": "SFA170",
    "category_ref": 1,
    "name": "Emily & Robert Murdick Memorial Scholarship",
    "url": "",
    "description": "The Emily & Robert Murdick Memorial Scholarship is available to full-time students with a minimum 3.0 cumulative GPA and demonstrated financial need. This scholarship is not available to students in the College of Education. Preference is given to U.S. born African Americans or Native Americans. Renewal of the award is based on maintaining satisfactory academic progress. A completed FAFSA is required to be considered for this scholarship.",
    "deadline": null,
    "limit": 100,
    "active": true
  },
  {
    "id": "SFA210",
    "category_ref": 1,
    "name": "Minnie Hyman Scholarship Fund",
    "url": "",
    "description": "The Minnie Hyman Scholarship Fund grants awards to a student who is a sophomore, junior, or senior with demonstrated financial need. Award is renewable upon application. A completed FAFSA is required to be considered for this scholarship.",
    "deadline": null,
    "limit": 100,
    "active": true
  },
  {
    "id": "SFA215",
    "category_ref": 1,
    "url": "",
    "deadline": null,
    "limit": 100,
    "name": "Brudzinski Scholarship Fund",
    "description": "The Brudzinski Scholarship is available to FAU students seeking undergraduate degrees in Hospitality, who maintain at least a 2.5 GPA, and are considered part-time(6 credits) or full-time students(12 credits). They must also demonstrate financial need. A completed FAFSA is required to be considered for this scholarship.",
    "active": true
  },
  {
    "id": "SFA220",
    "category_ref": 1,
    "name": "Reid Nix Endowed Scholarship Fund",
    "url": "",
    "description": "The Reid Nix Endowed Scholarship Fund supports students who have shown leadership potential by obtaining the rank of Eagle Scout via the Boy Scouts of America and undergraduate students, 25 years or older, returning to college after an absence of two or more years. All applicants must have demonstrated financial need, a minimum 3.0 GPA and must be enrolled in a minimum of 6 credits. A completed FAFSA is required to be considered for this scholarship.",
    "deadline": null,
    "limit": 200,
    "active": true
  },
  {
    "id": "SFA355",
    "category_ref": 1,
    "name": "David Neil Krinzman Memorial Scholarship",
    "url": "",
    "description": "Awarded to students in good academic standing with demonstrated financial need. A completed FAFSA is required to be considered for this scholarship",
    "deadline": null,
    "limit": 150,
    "active": true
  },
  {
    "id": "SFA360",
    "category_ref": 1,
    "name": "Milton & Gladys Meisner Scholarship Fund",
    "url": "",
    "description": "The Milton & Gladys Meisner Scholarship is awarded to students in Architecture, Ocean Engineering, and/or Pharmaceutical Studies. Recipients must be in their junior or senior year and demonstrate financial need. A completed FAFSA is required to be considered for this scholarship.",
    "deadline": null,
    "limit": 300,
    "active": true
  },
  {
    "id": "SFA370",
    "category_ref": 1,
    "name": "Angelos Langadas Endowed Scholarship",
    "url": "",
    "description": "The Angelos Langadas Endowed Scholarship is awarded to deserving students who are making progress with their education. Preference is given to students of Greek heritage with demonstrated financial need. A completed FAFSA is required to be considered for this scholarship.",
    "deadline": null,
    "limit": 150,
    "active": true
  },
  {
    "id": "SFA371",
    "category_ref": 1,
    "url": "",
    "deadline": null,
    "limit": 0,
    "name": "Helen E. and Robert K. Bero Endowed Scholarship Fund",
    "description": "The Helen E. and Robert K. Bero Endowed Scholarship is awarded to assist students in good academic standing with FAU who demonstrate financial need. The student must be involved in community service or activities outside of school. A completed FAFSA is required to be considered for this scholarship.",
    "active": true
  },
  {
    "id": "SFA440",
    "category_ref": 1,
    "name": "Julian Warren Weiss Endowment scholarship",
    "url": "",
    "description": "The Julian Warren Weiss Endowment Scholarship was established to aid students whose life experience or family challenges make higher education opportunities difficult, or students who have unexpected financial needs or unusual circumstances that arise during the year and impact the student's education. Students must have a minimum 2.5 GPA and demonstrate financial need. An essay is required explaining financial situations, career goals, and special accomplishments including how the student has overcome obstacles in life. A completed FAFSA is required to be considered for this scholarship. Awards are renewable so long as the criteria are met.",
    "deadline": null,
    "limit": 500,
    "active": true
  },
  {
    "id": "SFA455",
    "category_ref": 1,
    "name": "Edgewater Pointe Estates Scholarship",
    "url": "",
    "description": "Edgewater Pointe Estates Scholarship is for full or part time employees at Edgewater Pointe Estates who have been employed for at least 90 days and work a minimum of 12 hours per week. Selected applicants must have an undergraduate GPA of 2.75 or a graduate GPA of 3.0, and a letter from the organization confirming eligibility.",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "SFA490",
    "category_ref": 1,
    "url": "",
    "deadline": null,
    "limit": 0,
    "name": "Dania Beach Scholarship",
    "description": "The recipients of this scholarship must be full time degree seeking students, admitted to FAU. The applicant's primary address must be from the City of Dania. Applicants must demonstrate financial need. This scholarship is renewable for up to 4 years of undergraduate study, provided the recipient maintains a 3.0 GPA. A completed FAFSA is required to be considered for this scholarship.",
    "active": false
  },
  {
    "id": "SFA500",
    "category_ref": 1,
    "name": "Hicks Scholarship Endowment",
    "url": "",
    "description": "The Hicks Scholarship Endowment grants awards to undergraduate students who are residents of Ft. Lauderdale and are enrolled in the Charles E Schmidt College of Science, the College of Business, or the College of Engineering and Computer Science. Students must be enrolled full time with a 3.0 GPA.",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "SFA520",
    "category_ref": 1,
    "name": "Harriet C. Boettcher Endowed Scholarship",
    "url": "",
    "description": "The Harriet C. Boettcher scholarship is given to a deserving student with demonstrated financial need. Preference given to students of Asian heritage.",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "SFA529",
    "category_ref": 1,
    "name": "Lillian Delmarter Scholarship Endowment",
    "url": "",
    "description": "The Lillian Delmarter Scholarship Endowment was established by Lillian Delmarter because she never had the opportunity to complete her formal education; her goal is to help students with the ability to experience the joys of learning. Student must demonstrate financial need. A completed FAFSA is required to be considered for this scholarship",
    "deadline": null,
    "limit": 200,
    "active": true
  },
  {
    "id": "SFA590",
    "category_ref": 1,
    "name": "Albert Allister Endowed Scholarship Fund",
    "url": "",
    "description": "The Albert Allister Endowed Scholarship Fund was established as a result of a matured annuity for Albert Allister. Students must be in good standing with Florida Atlantic University. A completed FAFSA is required to be considered for this scholarship.",
    "deadline": null,
    "limit": 100,
    "active": true
  },
  {
    "id": "SFA710",
    "category_ref": 1,
    "name": "Thomas F. Fleming Jr Endowed Memorial Scholarship",
    "url": "",
    "description": "The Thomas F. Fleming Jr. Endowed Memorial Scholarship was established in honor of Thomas F. Fleming Jr., the late founder and chairman of the Foundation Board. Students must be in good standing with the University. The eligible majors are in the College of Nursing, Engineering and Computer Science. A completed FAFSA is necessary to be considered for this scholarship.",
    "deadline": null,
    "limit": 200,
    "active": true
  },
  {
    "id": "SFA790",
    "category_ref": 1,
    "url": "",
    "deadline": null,
    "limit": 200,
    "name": "Helen I. Craig Memorial Scholarship Endowment",
    "description": "The Helen I. Craig Memorial Scholarship Endowment is awarded to students with good academic standing at FAU, based on demonstrated financial need. A completed FAFSA is required to be considered for this scholarship.",
    "active": true
  },
  {
    "id": "SFA810",
    "category_ref": 1,
    "name": "Deerfield Beach Law Enforcement Trust Fund Scholarship",
    "url": "",
    "description": "This fund is to provide scholarships to academically at risk students who have at least a 2.0 GPA, and meet Florida Atlantic University's acceptance requirements, this scholarship is offered to students who have graduated from a public high school in Deerfield Beach. The student must serve with the Broward Sheriff’s Office –Deerfield Beach district for a total of two hundred and eight (208) semester hours each calendar year. This scholarship is to provide incentives for at risk students to avoid criminal activities and to promote a lifestyle to enhance opportunities to excel and pursue a crime free future.",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "SFA840",
    "category_ref": 1,
    "name": "Lawrence P. and Dorothy E. DeLisle Memorial Scholarship",
    "url": "",
    "description": "The Lawrence P. and Dorothy E. DeLisle Memorial Scholarship is intended to provide assistance for students who could not otherwise get an education at FAU. Students seeking undergraduate and graduate degrees in the areas of Business; Science; Biomedical; Nursing; Education; Engineering and Computer Science; or Architecture, Urban, and Public Affairs are eligible to apply. Students must be Florida residents, maintain a minimum 3.0 GPA, and demonstrate financial need as required by the FAU Office of Student Financial Aid. A completed FAFSA is required to be considered for this scholarship",
    "deadline": null,
    "limit": 700,
    "active": true
  },
  {
    "id": "SFA861",
    "category_ref": 1,
    "name": "Dorothy & Marshall Anderson Endowed Scholarship",
    "url": "",
    "description": "The Dorothy & Marshall Anderson Endowed Scholarship requires students to be in good academic standing, degree seeking, and have demonstrated financial need. A completed FAFSA is required to be considered for this scholarship.",
    "deadline": null,
    "limit": 200,
    "active": true
  },
  {
    "id": "SFA871",
    "category_ref": 1,
    "name": "Mildred and Rudy Reis Endowed Scholarship Fund",
    "url": "",
    "description": "The Mildred and Rudy Reis Endowed Scholarship requires students to be enrolled as an undergraduate or graduate student with demonstrated financial need and a minimum 3.25 GPA. A completed FAFSA is required to be considered for this scholarship.",
    "deadline": null,
    "limit": 100,
    "active": true
  },
  {
    "id": "SFA890",
    "category_ref": 1,
    "name": "The Harriet C. Boettcher US Military Endowed Scholarship",
    "url": "",
    "description": "The Harriet C. Boettcher US Military Endowed Scholarship fund was established to help support an undergraduate or graduate student enrolled in a minimum of 9 credits. First preference will be given to US military veterans having served active duty or the child of an active duty member of the US military. Second preference will be given to a child of a firefighter or police officer killed in the line of duty.",
    "deadline": null,
    "limit": 50,
    "active": true
  },
  {
    "id": "SFA900",
    "category_ref": 1,
    "name": "Ernest and Thea Kahn Endowed Scholarship Fund",
    "url": "",
    "description": "The Ernest and Thea Kahn Endowed Scholarship Fund is awarded to students who demonstrate financial need. All applicants must have attended a public, private, or parochial high school in Palm Beach County. A completed FAFSA is required to be considered for this scholarship.",
    "deadline": null,
    "limit": 100,
    "active": true
  },
  {
    "id": "SFA905",
    "category_ref": 1,
    "url": "",
    "deadline": null,
    "limit": 150,
    "name": "Emanuel Newsome Scholarship Fund",
    "description": "The Emanuel Newsome Scholarship is awarded to students with good academic standing at FAU, a minimum GPA of 2.7, and are enrolled as a Junior or Senior. Students must be enrolled in 9 or more credits per semester. The student must demonstrate a Leadership role, via participating in extracurricular activities, such as sports, student activities, Music, Volunteerism, Student Government, etc. A completed FAFSA is required to be considered for this scholarship.",
    "active": true
  },
  {
    "id": "SFA910",
    "category_ref": 1,
    "name": "Helen O'Leary Scholarship Fund",
    "url": "",
    "description": "The Helen O'Leary Scholarship supports undergraduate or graduate students at FAU with demonstrated financial need. A completed FAFSA is required to be considered for this scholarship",
    "deadline": null,
    "limit": 100,
    "active": true
  },
  {
    "id": "SFA930",
    "category_ref": 1,
    "name": "The McGee Family Scholarship",
    "url": "",
    "description": "The McGee Family Scholarship award is given to a full-time undergraduate student who demonstrates financial need. A completed FAFSA is required to be considered for this scholarship.",
    "deadline": null,
    "limit": 100,
    "active": true
  },
  {
    "id": "SFA950",
    "category_ref": 1,
    "name": "Grace Fait Asian Women Education Assistance Endowment",
    "url": "",
    "description": "The Grace Fait Asian Women Education Assistance Endowment is awarded with preference given to a female of Asian descent. Recipient must have a minimum GPA of 3.5, be in good standing at FAU, and must have demonstrated financial need. A completed FAFSA is required to be considered for this scholarship.",
    "deadline": null,
    "limit": 100,
    "active": true
  },
  {
    "id": "SFA999",
    "category_ref": 1,
    "name": "Adam Jay Harris Endowed Memorial Scholarship",
    "url": "",
    "description": "The Adam Jay Harris Endowed Memorial Scholarship is in memory of a former FAU pre-med student, Adam Jay Harris. Recipients must be full time undergraduate students pursuing a pre-med course of study with a minimum 3.0 GPA.",
    "deadline": null,
    "limit": 100,
    "active": true
  },
  {
    "id": "SGASCH",
    "category_ref": 1,
    "name": "Student Government Scholarship",
    "url": "",
    "description": "The Student Government Scholarship is awarded to students seeking a 4 year undergraduate degree or a graduate degree and are enrolled at least half-time. (Undergrad: 6 credits. Graduate: 5 credits) Applicants must have a minimum 2.5 GPA and must be a US citizen or permanent resident. Applicant must also provide a letter of recommendation from an instructor, employer or advisor. The letter must be the original and CURRENT and not from a relative. UWC members and Student Government members receiving tuition reimbursements are ineligible for this scholarship.",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "SKPSCH",
    "category_ref": 1,
    "name": "Senator Ken Pruitt Scholarship",
    "url": "",
    "description": "The Senator Ken Pruitt Scholarship will be awarded to two undergraduate and two graduate students who have extensive leadership accomplishments and have demonstrated commitment to civic duty via participation in student activities. Students must submit an application listing their leadership activities in high school or college and the academic year they occurred. A current letter of recommendation from the faculty members of a campus club or organization in which they participated. Students must have a 3.0 or higher GPA.",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "TEASCH",
    "category_ref": 1,
    "name": "Transfer Education Achievement Award (TEAA)",
    "url": "",
    "description": "Awards for incoming junior transfer students from one of Florida's College System institutions. Students must have a minimum 3.0 GPA and demonstrate financial need. Available for part-time and full-time students Renewable up to five semesters or upon completion of an Undergraduate Degree.",
    "deadline": null,
    "limit": 300,
    "active": true
  },
  {
  "id": "SFA070",
  "category_ref": 1,
  "url": "",
  "deadline": null,
  "limit": 100,
  "name": "Dar Indian Scholarship",
  "description": "The Dar Indian Scholarship are for members of the Seminole or Miccosukee Indian Tribes. Available to members of tribes living in Florida. A completed FAFSA is required to be considered for this scholarship.",
  "active": true
},
{
  "id": "SFA155",
  "category_ref": 1,
  "url": "",
  "deadline": null,
  "limit": 100,
  "name": "Stewart and Wendy Martin Scholarship Endowment",
  "description": "The Stewart and Wendy Martin Scholarship is to support scholarships for students at the University who are active military veterans, or who are first time college attendees. A completed FAFSA is required to be considered for this scholarship.",
  "active": true
},
{
  "id": "SFA875",
  "category_ref": 1,
  "url": "",
  "deadline": null,
  "limit": 100,
  "name": "Sue Peavy Hughes Scholarship Endowment",
  "description": "The Sue Peavy Hughes Scholarship is awarded to students with good academic standing at FAU, based on demonstrated financial need. A completed FAFSA is required to be considered for this scholarship.",
  "active": true
},
{
  "id": "SFA920",
  "category_ref": 1,
  "url": "",
  "deadline": null,
  "limit": 200,
  "name": "Robert L. Shattner Scholarship Endowment",
  "description": "The Robert L. Shattner Scholarship Endowment is intended for students whose life experiences or family challenges make higher educational opportunities difficult, or to aid students who have unexpected financial needed or unusual circumstances that arise during the year that impacts their education. Student must have minimum 2.5 GPA and must have demonstrated financial need. A completed FAFSA is required to be considered for this scholarship.",
  "active": true
},
{
  "id": "SFA940",
  "category_ref": 1,
  "url": "",
  "deadline": null,
  "limit": 200,
  "name": "Konbit Kreyol Lambert and Romain Haitian Service Scholarship",
  "description": "Konbit Kreyol Lambert and Romain Haitian Service Scholarship was created in the memory of Ms. Lambert and Ms. Romain who passed away. Preference will be given to students of Haitian decent and/or active in Kronbit Kreylol. Student must be living in the United States, either a US citizen or permanent resident and an undergraduate degree seeking with college credits and a GPA of 2.8 or higher.  Student must be enrolled in a minimum of 9 credits per semester and must have demonstrated financial need.  A completed FAFSA is required to be considered for this scholarship. ",
  "active": true
},
{
  "id": "SFA135",
  "category_ref": 1,
  "url": "",
  "deadline": null,
  "limit": 100,
  "name": "Richard and Mary Cook Business Scholarship Endowment Fund",
  "description": "The Richard and Mary Cook Business Scholarship is awarded to an incoming undergraduate freshman or a first year or transfer student, who are business graduates of Northeast High School in Ft. Lauderdale, Florida. Student must have demonstrated need. A completed FAFSA is required to be considered for this scholarship.",
  "active": true
},
{
  "id": "SFA120",
  "category_ref": 1,
  "url": "",
  "deadline": null,
  "limit": 300,
  "name": "Marilyn and Jay Weinberg Scholarship ",
  "description": "The Marilyn and Jay Weinberg Scholarship is awarded to assist students in good standing at FAU, based on demonstrated financial need. A completed FAFSA is required to be considered for this scholarship.",
  "active": true
},
  {
    "id": "EXT002",
    "category_ref": 3,
    "name": "Spencer Foundation Dissertation Fellowship",
    "url": "http://www.spencer.org/content.cfm/apply",
    "description": "Through the Dissertation Fellowship Program, the Spencer Foundation aims to build capacity in the education research community by supporting a new generation of scholars from a wide range of fields. ",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT005",
    "category_ref": 3,
    "name": "Afateens.org $5000 Scholarship",
    "url": "http://youngleadersofafa.org/about_new.html",
    "description": "Scholarship requires essay on \"How has Alzheimer's changed your life?\"",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT009",
    "category_ref": 3,
    "name": "National Law Enforcement & Firefighters Children's Foundation",
    "url": "http://nleafcf.org/scholarships/",
    "description": "The National Law Enforcement and Firefighters Children's Foundation Scholarship Awards are for children of law enforcement and firefighting personnel who were lost in the line of duty. These awards are designed to reward excellence, recognize accomplishments and help students by providing funding for their post secondary education at qualified institutions.",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT013",
    "category_ref": 3,
    "name": "Federal Government Internships for Civil Engineering Students",
    "url": "http://www.usphs.gov/",
    "description": "The Indian Health Services (a federal government agency of the U.S. Department of Health & Human Services and the U.S. Public Health Services) is seeking civil, construction, and environmental engineering interns. Internships generally occur during the summer months, but are also available at other times of the year. Students must be U.S. citizens and must have completed their sophomore year at the time the internship occurs. Students can gain valuable engineering experience while receiving competitive pay, reimbursement for travel, and other medical and government benefits. For more information, contact CDR Javier B. Franco at (954) 894-1060 ext. 10902 or email at javierfranco@semtribe.com",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT015",
    "category_ref": 3,
    "name": "Shawn Carter Foundation Scholarship",
    "url": "https://www.shawncartersf.com/scholarship-fund/",
    "description": "The Shawn Carter Scholarship Fund (SCSF) provides individual grants ranging from $1,500 to $2,500 to every student who qualifies and reapplies yearly, from admission to graduation. The grant can be used to cover tuition expenses and related supplemental educational expenses such as books, lab fees, travel and select costs of living. All Shawn Carter Scholars are required to 'give back' by conducting community service and by serving as mentors to younger, aspiring Shawn Carter Scholars. All high school seniors, undergraduate (2-year or 4-year) college students, and students at vocational or trade schools are eligible to apply. All applicants must be US citizens, 25 years old or younger, and have a minimum GPA of 2.0. The program attracts candidates from all backgrounds, nation-wide. They all have a compelling desire to pursue higher education, in spite of many personal, socio-economic setbacks, including teen pregnancy, former incarceration, interrupted schooling, and homelessness. They are hardworking, resilient and determined individuals who want to make positive contributions to their local and global communities, and they turn to the SCSF to make their ambitions and dreams possible.",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT017",
    "category_ref": 3,
    "name": "Broward Women's Alliance (BWA) Scholarship",
    "url": "http://www.browardwomensalliance.org/index.cfm?cid=1480",
    "description": "This scholarship is to benefit women who need support and encouragement for professional development through education. The applicants must be enrolled in a degree-seeking or certificate program at a fully accredited school or college. Applicants must also be a resident of Broward County. ",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT021",
    "category_ref": 3,
    "name": "Boca Rotary Club of Boca Raton Sunrise Foundation Scholarship - General",
    "url": "http://www.fau.edu/finaid/types-of-aid/scholarships/General Scholarship Application 5-15-17.pdf",
    "description": "This scholarship is available to permanent residents of greater Boca Raton who are degree seeking students. This includes students residing between Deerfield Beach/Coconut Creek and Boynton Beach. This scholarship is for tuition reimbursement for full time and part time students who are seeking a degree in Florida. ",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT022",
    "category_ref": 3,
    "name": "Boca Rotary Club of Boca Raton Sunrise Foundation Scholarship - Future Teachers of Palm Beach County",
    "url": "http://www.fau.edu/finaid/types-of-aid/scholarships/Teacher Scholarship Application  5-15-17.pdf",
    "description": "This scholarship is available to permanent residents of greater Boca Raton who have a stated goal of becoming a teacher for students in Palm Beach County, or current teachers updating their skills. This includes students residing between Deerfield Beach/Coconut Creek and Boynton Beach. This scholarship is for tuition reimbursement for full time and part time students who are seeking a degree in Florida.",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT025a",
    "category_ref": 3,
    "name": "Viner Community Scholarship",
    "url": "http://www.vinerscholars.org/",
    "description": "The Viner Community Scholarship is a program that will provide South Palm Beach County High School students with four year scholarships to colleges and universities in the State of Florida public educational system.",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT026",
    "category_ref": 3,
    "name": "Walter and Lalita Janke Foster Care Scholarship",
    "url": "http://www.walterandlalitajankecharitablefoundation.org/Scholarship-Types.html",
    "description": "Any student who was placed in the foster care program of any state and meets the minimum requirements. Requirements: Student must maintain a GPA of 2.5 for the first year that the scholarship has been granted. After the first year the GPA requirement will be an average of 3.0. Please refer to the application for more details.",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT027",
    "category_ref": 3,
    "name": "Walter and Lalita Janke Academic Excellence Scholarship",
    "url": "http://www.walterandlalitajankecharitablefoundation.org/Scholarship-Types.html",
    "description": "Any student that has a GPA of 3.7 or above for the previous two semesters (not cumulative) of attending an education institution and meets the minimum requirements. Requirements: Student must maintain a GPA of 3.7 or above as a full time student. Please refer to the application for more details.",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT028",
    "category_ref": 3,
    "name": "Walter and Lalita Janke Health Science Programs Scholarship",
    "url": "http://www.walterandlalitajankecharitablefoundation.org/Scholarship-Types.html",
    "description": "Any student that is enrolled in the Health Science Program (or equivalent), has a GPA of 3.7 or above for the previous two semesters form an educational institution and meets the minimum requirements. Requirements: Student must maintain a GPA of 3.7 or above. Please refer to the application for more details.",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT029",
    "category_ref": 3,
    "name": "Walter and Lalita Janke Business Scholarship",
    "url": "http://www.walterandlalitajankecharitablefoundation.org/Scholarship-Types.html",
    "description": "Any student who is enrolled in a Business Degree Program (or equivalent), has a GPA of 3.7 or above for the previous two semesters form an educational institution and meets the minimum requirements. Requirements: Student must maintain a GPA of 3.7 or above. Please refer to the application for more details.",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT030",
    "category_ref": 3,
    "name": "Walter and Lalita Janke Fellowship Scholarship",
    "url": "http://www.walterandlalitajankecharitablefoundation.org/Scholarship-Types.html",
    "description": "Fellowship available at the PAMS clinic in Chincha, Peru. Clinic seeking full time, exclusive specialist in Cardiology and Gastroenterology. For details of fellowship please email anamaysalgado01@gmail.com and request information about the PAMS Chincha Fellowship. Please refer to the application for more details.",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT031",
    "category_ref": 3,
    "name": "Soroptimist Programs: Live Your Dream Awards",
    "url": "http://www.soroptimist.org/awards/english/application.pdf",
    "description": "Soroptimist organization awards three $1500 scholarships for tuition or other related educational expenses for women enrolled in vocational or undergraduate degree programs who provide the primary financial support for themselves and dependents and have financial need. A completed FAFSA is required to be considered for this scholarship. Email the application, located at the link above, to susanmotley14@gmail.com for consideration.",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT035",
    "category_ref": 3,
    "name": "Government Finance Officers Association Scholarships",
    "url": "http://www.gfoa.org/about-gfoa/student-opportunities/scholarships-full-and-part-time-students",
    "description": "The Government Finance Officers Association (GFOA) of the United States and Canada, which serves government finance professionals throughout those countries, is pleased to announce that the following scholarships are available: The Minorities in Government Scholarship, the Frank L. Greathouse Government Accounting Scholarship, and the Daniel B. Goldberg Scholarship. Candidates for these scholarships should have a superior record of academic achievement and/or job performance and show promise of completion of their studies at a high level of performance. In addition, candidates should have plans to pursue a career in state or local government finance.",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT036",
    "category_ref": 3,
    "name": "Kantner Foundation Scholarship",
    "url": "http://kantnerfoundation.org/",
    "description": "The Kantner Foundation fund scholarships for high school seniors attending public, private or homeschools in Palm Beach or Martin counties.  The scholarships are awarded on the basis of academic achievement, leadership activities, entrepreneurship activities and community involvement.",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT038",
    "category_ref": 3,
    "name": "AAUW (American Association of University Women) Scholarship",
    "url": "http://aauw-fl.aauw.net/branches/pompano/",
    "description": "Scholarships are awarded each year to women entering their third or fourth year of college in the coming year. A 3.0 GPA or higher is required",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT047",
    "category_ref": 3,
    "name": "Scholarship For Students With Diagnosis Of Tourette Syndrome",
    "url": "http://www.dollars4ticscholars.org/application",
    "description": "Detailed information about the scholarhsip can be found at the website.",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT049",
    "category_ref": 3,
    "name": "Veterans Innovation Partnership (VIP)",
    "url": "http://www.vipfellowship.org/",
    "description": "The VIP is a new public-private alliance platform aimed at serving America's veterans and separating service members by preparing them for diplomacy and development careers, providing education and employment resources and expertise while enhancing America's global leadership.",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT056",
    "category_ref": 3,
    "name": "SOPREMA Scholarship",
    "url": "http://soprema.us/soprema-scholarship-program",
    "description": "SOPREMA has established a scholarship program as a commitment to the continued success and growth of our industry by investing in the next generation dedicated to the building and engineering industry. The SOPREMA Scholarship was founded to assist students pursuing a degree in architecture, engineering, construction management or a similar field at an accredited four-year college or university.",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT058",
    "category_ref": 3,
    "name": "Folds of Honor Scholarships",
    "url": "https://www.foldsofhonor.org/scholarships",
    "description": "Scholarships for spouses or dependents of U.S. Veterans. Visit the site for more details.",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT059",
    "category_ref": 3,
    "name": "The Thomas R. Pickering Fellowship Program",
    "url": "http://www.twc.edu/pickering2016",
    "description": "The Pickering Fellowship provides 10 undergraduate and 20 graduate students with financial support, mentoring, and professional development to prepare them academically and professionally for a career in the U.S. Foreign Service. Candidates must be in the junior year of undergraduate studies OR seeking admission to a two-year graduate program for Fall 2016. Candidates must also be a U.S. citizen and have a GPA of 3.2 or higher on the 4.0 scale.",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT060",
    "category_ref": 3,
    "name": "AIA Palm Beach Scholarship",
    "url": "http://www.fau.edu/finaid/pdf/scholarships/AIA%20Scholarship%20Application.pdf",
    "description": "The Palm Beach Chapter of the AIA has created a scholarship fund available to full time Architecture students whose primary residence is in Palm Beach County and are enrolled in an accredited architecture program in their 3rd, 4th, or 5th year.",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT062",
    "category_ref": 3,
    "name": "Florida Stormwater Association Educational Foundation's Scholarship Program",
    "url": "http://www.florida-stormwater.org/scholarship",
    "description": "The Florida Stormwater Association Educational Foundation’s Scholarship Program awards financial assistance to qualified students attending Florida colleges and universities whose educational interest is in stormwater research, management or finance. Applications are accepted annually from graduate students in colleges or schools of engineering, natural science, public administration (or closely related fields) that have an interest in stormwater quality, management or finance. Eligibility is limited to students in good standing that are enrolled in a graduate program at a Florida college or university.  A scholarship of $2,000 is awarded each year.",
    "deadline": "2018/08/03",
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT063",
    "category_ref": 3,
    "name": "Thornton Tomasetti Foundation",
    "url": "http://www.thorntontomasettifoundation.org/",
    "description": "Applicants must be a senior student entering or matriculated in a program that results in a master's degree specializing in structural engineering.  Candidates must intend to enter the professional practice of structural engineering in the building field after completion of their degree requirements. If qualified and interested, please see a structural engineering faculty (Dr. Arockiasamy, Dr. Reddy, Dr. Rosson or Dr. Scarlatos) to send your nomination to the Department Chair.",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT066",
    "category_ref": 3,
    "name": "Anchor Scholarship Foundation",
    "url": "http://www.anchorscholarship.com/apply.html",
    "description": "The Anchor Scholarship Foundation provides scholarships to eligible family members (children and spouses) of active duty,  retired or honorably discharged Surface Navy personnel.",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT069",
    "category_ref": 3,
    "name": "Benjamin A Gilman International Scholarship Program",
    "url": "http://www.iie.org/en/Programs/Gilman-Scholarship-Program",
    "description": "The applicant must be a U.S. citizen undergraduate receiving a Federal Pell Grant or provide proof that he/she will be receiving a Pell Grant at the time of application or during the term of his/her study abroad program or internship. Student must also be applying to or have been accepted into a three week (21 days), or, for community college students, two week (14 days) study abroad program or internship eligible for credit by the student's accredited institution of higher education in the U.S.  Students who are interested in applying for a Gilman Scholarship should contact FAU Education Abroad prior to beginning the application to ensure they are a qualifying student in a qualifying study abroad program.",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT070",
    "category_ref": 3,
    "name": "AWRA Florida 2016 Scholarship and Grant Applications",
    "url": "http://www.awraflorida.org/grants-awards",
    "description": "AWRA Florida has a mission to support education through the Rosanne Clementi Education Program and awards scholarships and grants to pre-Kindergarten through 12th grade teachers, environmental education centers, high school seniors, and undergraduate and graduate college or university students in Florida. Click the title above to view the variety of Grants and Scholarships being offered. ",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT072",
    "category_ref": 3,
    "name": "AAC Behavioral Health Academic Scholarship Program",
    "url": "http://americanaddictioncenters.org/behavioral-health-academic-scholarship/",
    "description": "AAC Behavioral Health Academic Scholarship is available for the U.S full or part-time college undergraduate or graduate students who are enrolled or entering in an academic program in nursing, counseling, psychology, social work, marriage/family therapy, or another curriculum that focuses on treating mental health and substance use disorder. Click the title above for more details.",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT073",
    "category_ref": 3,
    "name": "Wells Fargo Veterans Scholarship Program and Emergency Grant Program",
    "url": "https://www.scholarsapply.org/wellsfargoveteransemergency/",
    "description": "Awards will be made to honorably discharged veterans or spouses of disabled veterans who are high school or GED graduates. Renewable scholarships for up to $7,000 per year will be granted, determined by financial need and consideration of academic performance, work experience, leadership, community service, and challenges with completing a postsecondary program. Each award renewal will increase by $1,000 over the previous year to encourage program completion for each recipient.  Click on the title above for more details. ",
    "deadline": "2018/02/28",
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT074",
    "category_ref": 3,
    "name": "StudySoup Women in Technology Scholarship",
    "url": "https://studysoup.com/women-in-technology-scholarship",
    "description": "As a company driven to help students succeed, StudySoup knows that college is an important step along many career paths, but it can be expensive. Students can upload notes to StudySoup to lighten their financial burden. However, we still felt like we could do more to give back to the future leaders of the world. We also believe that it is our responsibility to foster innovation in the field of technology and help underrepresented students break down barriers. Therefore, we are offering a $1,000 Women in Technology Scholarship to an outstanding female student who is planning a career in the field of computer science and/or computer programming.",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT076",
    "category_ref": 3,
    "name": "CGTrader Scholarship 2017 Challenge",
    "url": "https://www.cgtrader.com/scholarships",
    "description": "Each semester CGTrader challenges students to dig into the field of technology writing an essay on how innovative technologies are transforming our lives. Enter the CGTrader Scholarship 2017 challenge to win $3,000 for your education bills. All you have to do is write and submit an original essay on the topic  “The future of technology in education”",
    "deadline": null,
    "limit": 0,
    "active": false
  },
  {
    "id": "EXT077",
    "category_ref": 3,
    "name": "Women's Chamber Foundation Scholarship",
    "url": "http://www.fau.edu/finaid/pdf/scholarships/WCF%20Scholarship%20Application%202018.docx",
    "description": "As part of the Mission to promote opportunities for professional growth and development, The Women’s Chamber Foundation presents scholarship awards annually to deserving high school girls and women who want to optimize their lives through higher education.  The Women’s Chamber Foundation’s highest priority is raising funds to support the Scholarship Program. See linked applicaton.",
    "deadline": "2018/03/03",
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT081",
    "category_ref": 3,
    "name": "Frederick W. and Grace P. Brecht Scholarship",
    "url": "http://www.sfa.ufl.edu/pdf/1819Brecht.pdf",
    "description": "For residents of Brevard County with at least 2.0 GPA and have financial need demonstrated by their FAFSA. Click the link above to download the application",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT082",
    "category_ref": 3,
    "name": "Broward Women's Alliance Scholarship Fund for the Advancement of Women",
    "url": "http://www.browardwomensalliance.org/index.cfm?cid=1480",
    "description": "Established with the Community Foundation of Broward on June 30, 1997, the purpose of the Broward Women's Alliance (BWA) Fund for the Advancement of Women exists to benefit women who need support and encouragement for professional development through education. Click the link above for details and the application",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT083",
    "category_ref": 3,
    "name": "Fales & Fales Law Enforcement Family Member Scholarship",
    "url": "https://www.faleslaw.com/law-enforcement-family-member-scholarship.html",
    "description": "Fales & Fales has a wonderful scholarship opportunity for students with its 3rd Law Enforcement Family Member Scholarship! Very simply, one university/law school student who is related to a law enforcement officer will be awarded a $1,000 in financial aid. We've included a link with all the information needed above. Fales & Fales is happy to show our support to current officers. Click the link above for details and the application",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT084",
    "category_ref": 3,
    "name": "Speakerxpert $1000 Internet Marketing Scholarship",
    "url": "http://speakerxpert.com/scholarship/",
    "description": "We have created the Speakerxpert Internet Marketing Scholarship for Undergraduate or Postgraduate students with the passion of “Internet Marketing” to receive $1000 award. Those students who are currently studying in the areas of Marketing, Business, IT or Communications may be extremely interested in this scholarship program. There is no need for expertise or experience in this field , a passion for internet marketing content creation is enough. Click the link above to apply",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT085",
    "category_ref": 3,
    "name": "The Expert Institute's Annual Healthcare and Life Sciences Scholarship",
    "url": "https://www.theexpertinstitute.com/writing-contest-medical-scholarship/",
    "description": "Without the technical insights provided by members of the healthcare and life science communities, attorneys would not be able to effectively seek justice for their clients. From prescription drug and medical device torts to intellectual property disputes surrounding proprietary biological research, healthcare and life science professionals have become an essential part of American justice. In recognition of these vital contributions to the practice of law, The Expert Institute is offering a $1000 scholarship to students in medicine and the life sciences. Full information on the scholarship as well as the application may be found at the link above. ",
    "deadline": "2017/12/31",
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT086",
    "category_ref": 3,
    "name": "CJ Pony Parts Scholarship Video Contest",
    "url": "http://www.cjponyparts.com/cj-pony-parts-scholarship-video-contest",
    "description": "CJ Pony Parts is proud to offer two scholarships each year, each worth $500, to students who are enrolling in post-secondary education in their next semester. Students must be U.S. residents and enrolling in post-secondary education next semester. Application information is available at the link above. ",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT087",
    "category_ref": 3,
    "name": "Marine Gunnery Sergeant John David Fry Scholarship",
    "url": "http://www.benefits.va.gov/GIBILL/Fry_scholarship.asp",
    "description": "The Marine Gunnery Sergeant John David Fry Scholarship (Fry Scholarship) provides Post-9/11 GI Bill benefits to the children and surviving spouses of Servicemembers who died in the line of duty while on active duty after September 10, 2001. Eligible beneficiaries attending school may receive up to 36 months of benefits at the 100% level. Click the link above for more information.",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT089",
    "category_ref": 3,
    "name": "HACU/ Southwest Airlines 13th Annual ¡Lánzate! Travel Award Program",
    "url": "http://www.hacu.net/hacu/Lanzate.asp",
    "description": "The Hispanic Association of Colleges and Universities has opened applications for a travel program called ¡Lánzate!/Take Off! Travel Program. The program is geared towards undergraduate and graduate Latino students with financial need. If you or someone you know is currently enrolled in a two or four year university, maintains at least a 2.5 GPA, and is in good standing, you may be eligible. Travel is provided by Southwest Airlines. Click the link above for more details.",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT090",
    "category_ref": 3,
    "name": "HACU Scholarship Program",
    "url": "http://www.hacu.net/hacu/Scholarships.asp",
    "description": " The Hispanic Association of Colleges and Universities is pleased to offer scholarship opportunities to assist in defraying some of your college expenditures. Over 23 scholarships totaling $63,500 will be awarded to eligible students. Click the link above for details.",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT091",
    "category_ref": 3,
    "name": "Baby Gear Guide Scholarship",
    "url": "http://babygearguide.net/scholarship",
    "description": "Baby Gear Guide is offering a $1,000 scholarship for potentially any student. In order to participate in the scholarship contest, applicants must be in good academic standing with their current educational institution, applicants under 18 must have permission from a parent or legal guardian, and applicants must apply to the contest via email and provide your name, address and the name of institution you are attending or plan to attend. Click the link above for more information.",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT092",
    "category_ref": 3,
    "name": "National Counsel of Jewish Women Scholarship",
    "url": "http://www.fau.edu/finaid/pdf/scholarships/DOC042517.pdf",
    "description": "The National Counsel of Jewish Women is proud to announce that it has a $1,000 scholarship to award to a deserving student choosing to pursue a career in nursing. Click the link above for the application and more details.",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT093",
    "category_ref": 3,
    "name": "Market.biz $1500 Scholarship",
    "url": "https://market.biz/scholarship/",
    "description": "The Market.biz Research service intends to assist young people in achieving their ambitions by hosting a blogging scholarship competition. The winner will receive a $1,000 prize to help with their higher education tuition and the runner-up $500. The deadline for submitting your essay for the Fall Scholarship is June 30th, 2017 and for the 2018 Spring Scholarship is October 30th, 2017. Click the link above for more details. ",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT094",
    "category_ref": 3,
    "name": "THE DREAM.US",
    "url": "http://www.thedream.us",
    "description": "TheDream.US, a nationwide scholarship for undergraduates that qualify as DREAMers (DREAMers are immigrant youth who came to this country at a very young age without documentation). This is a renewable scholarship providing recipients a maximum of $14,500 for an associate’s degree, and maximum of $29,000 for a bachelor’s degree. Transfer partners include Broward College, Palm Beach State College, and Miami Dade College.  Click the link above for more details.  For questions specific to FAU, contact Miguel Hernandez at hernandezm@fau.edu or (954)236-1329.",
    "deadline": "2018/03/01",
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT095",
    "category_ref": 3,
    "name": "Wells Fargo Scholarship Program for People with Disabilities",
    "url": "https://scholarsapply.org/pwdscholarship/?utm_campaign=Wells%20Fargo%20PWD&utm_source=hs_email&utm_medium=email&utm_content=56809672&_hsenc=p2ANqtz--Bu17BK69xrVFDSG2ulRoeAb91zLFZLtLX6FjtVmaOaoTAuuc814TiJpwQD10Ul_4vmjGwdHCPHanWG9nPSiC-hUx38A&_hsmi=56809672",
    "description": "Wells Fargo is providing renewable scholarships of up to $2,500 for full-time students and up to $1,250 for half-time students.",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT096",
    "category_ref": 3,
    "name": "College Sports Recruiting Scholarship",
    "url": "https://www.collegesportsscholarships.com/scholarship.htm",
    "description": "Sports is a more than wins and losses and while we are committed to helping athletes find opportunities to play sports at the college level, we believe the most important thing is getting a college education. As an organization we are proud to award a $1,000 scholarship to a college student who best represents a true leader in sports and life. We encourage all current or future college students who competed in a sport at the high school level to apply for the College Sports Recruiting Scholarship. Click the link above for more details.",
    "deadline": "2018/07/01",
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT097",
    "category_ref": 3,
    "name": "The Recovery Village Health Care Scholarship",
    "url": "https://www.therecoveryvillage.com/scholarships/",
    "description": "The Recovery Village is dedicated to maintaining exceptional service while providing unique opportunities for education and personal development. As part of this commitment, The Recovery Village is offering a $1,000 scholarship to students pursuing a medical-related course of study. To enter to win a $1,000 scholarship, simply submit a short essay (no more than 500 words) describing why you are passionate about substance use disorder and mental health treatment. Essays can be in the form of a personal narrative with a medical perspective or focus specifically on clinical experience. Click the link above for more details.",
    "deadline": "2018/06/30",
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT098",
    "category_ref": 3,
    "name": "The BackPackerCo Scholarship 2017-18",
    "url": "http://www.thebackpackerco.com/#scholarship",
    "description": "At TheBackPackerCo, we believe that travel is all about taking the road less travelled and stumbling upon some hidden gems! We wish to extend this travelling experience to students to help them travel the world, and broaden their horizons, discovering some hidden gems of their own in the process! The scholarship program held by TheBackPackerCo is open for all the students who are passionate about traveling. Click the link above for more details.",
    "deadline": "2018/10/30",
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT099",
    "category_ref": 3,
    "name": "Adrian Rubin Scholarship",
    "url": "http://adrianrubinscholarship.com/",
    "description": "The Adrian Rubin Scholarship was created with our leaders of the future (current students) in mind. Over the years, college has become increasingly expensive and necessary. This scholarship serves the purpose of being able to help one student get closer to achieving their goal of landing their dream career without having to rack up hundreds of thousands of student loan debt in order to do so. Click the link above for more details.",
    "deadline": "2019/01/01",
    "limit": 0,
    "active": false
  },
  {
    "id": "EXT100",
    "category_ref": 3,
    "name": "School District of Palm Beach County Scholarship Search",
    "url": "http://apps.palmbeachschools.org/ScholarshipSearch/",
    "description": "Looking for money to pay for school? This tool matches you to scholarship money. This is a free scholarship matching service provided by the School District of Palm Beach County. Click the link above to access the search.",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT101",
    "category_ref": 3,
    "name": "Miami Dolphins Accepting Applications for Social Justice Grant Program and Project Change Scholarship",
    "url": "http://adrianrubinscholarship.com/",
    "description": "The Miami Dolphins are now accepting applications for a social justice grant program and Project Change scholarship. The Dolphins organization has earmarked funds for a social justice grant program to impact organizations in need that are involved in community engagement, education or justice reform. The grant program is guided by an advisory committee of Dolphins players and staff. The Miami Dolphins also are accepting applications for the Project Change Scholarship, a program that will identify one high school student each year and pay for their tuition to college over a four-year period. The goal of the scholarship is to target students to impact their lives, so they can make a change in their community. Click the link above for more details.",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT102",
    "category_ref": 3,
    "name": "OppU Achievers Scholarship",
    "url": "https://www.opploans.com/scholarship/",
    "description": "Students, must be enrolled full time in high school or at least part time in college, graduate, professional. Possess a cumulative GPA of at least 3.0/4.0; Be a U.S. citizen. Click the link above for more details.",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT103",
    "category_ref": 3,
    "name": "Future Internet Marketing Scholarship 2018",
    "url": "https://www.scholarships-gov.com/future-internet-marketing-scholarship",
    "description": "This scholarship will be of interest to students who are currently studying Medical, Marketing, Business, IT or Communications and Engineering. Click the link above for more details.",
    "deadline": "2018/04/30",
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT104",
    "category_ref": 3,
    "name": "Fulbright U.S. Student Program",
    "url": "https://us.fulbrightonline.org/about",
    "description": "The Fulbright U.S. student programs provides grants for teaching, research, and study in over 140 countries.  The program is open to U.S. citizens who are graduating seniors and recent bachelor’s degree recipients, Master’s and doctoral candidates, and young professionals including writers, creative and performing artists, journalists, and those in law, business, and other professional fields.  FAU students or recent alumni who are interested in applying should contact FAU Education Abroad for more information and institutional deadlines.",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT105",
    "category_ref": 3,
    "name": "Blake Rubin Scholarship",
    "url": "http://www.blakerubinscholarship.com/",
    "description": "The Blake Rubin Scholarship was created to help future generations get the education needed to prepare for adulthood. Since the price of obtaining higher learning is always increasing, the goal of this scholarship is to help get one student one step closer to obtaining their desired degree. Click the link above for more details.",
    "deadline": "2019/01/31",
    "limit": 0,
    "active": false
  },
  {
    "id": "EXT106",
    "category_ref": 3,
    "name": "American Legion, Department of Florida",
    "url": "https://www.floridalegion.org/programs-services/scholarships/",
    "description": "The American Legion, Department of Florida offers scholarship opportunities for College students enrolled in Medical or Nursing Schools. Click the link above for more details.",
    "deadline": "2018/04/01",
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT107",
    "category_ref": 3,
    "name": "City of Greenacres 2018 Educational Scholarship Program",
    "url": "https://greenacresfl.gov/administration/page/city-greenacres-announces-2018-educational-scholarship-program/",
    "description": "The City of Greenacres is pleased to announce the 2018 Educational Scholarship Program consisting of five, $1,500.00 Educational Scholarships, including one to be awarded in memory of former City employee Denise Padgett to an applicant who has achieved athletic success and one to be awarded in memory of former Councilman Norman W. Rose. Click the link above for more details.",
    "deadline": "2018/04/02",
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT108",
    "category_ref": 3,
    "name": "Boca Raton Garden Club Scholarship",
    "url": "http://www.fau.edu/finaid/pdf/scholarships/DOC022718.pdf",
    "description": "The Boca Raton Garden Club has a scholarship available for students who currently attend a Florida college or university and are enrolled in an undergraduate or Master's program. Students must be residents of Palm Beach County. Click the link above to download the application.",
    "deadline": "2018/03/16",
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT109",
    "category_ref": 3,
    "name": "National DAR American Indian Scholarship",
    "url": "https://www.dar.org/national-society/scholarships/american-indian",
    "description": "This scholarship is awarded to help Native Americans students of any age, any tribe and in any state striving to get an education at the undergraduate or graduate levels.  However, undergraduate students are given preference. All awards are judged based on financial need and academic achievement. Applicants must be Native Americans (proof of American Indian blood is required by letter or proof papers) in financial need and have a grade point average of 3.25 or higher. This is a one-time $4,000 award. Click the link above for more information.",
    "deadline": null,
    "limit": 0,
    "active": true
  },
  {
    "id": "EXT110",
    "category_ref": 3,
    "name": "Hartford Technology Rental Scholarship 2018",
    "url": "https://hartfordrents.com/scholarship",
    "description": "Hartford Technology Rentals are offering two $1000 scholarships that are available to students studying in the IT or related fields. Simply fill out the form and tell us about yourself and what you hope to do with your IT degree in the short essay form. One scholarship will be awarded in December and one in May (Cut-off dates: 12/16 & 5/17). You may apply for both scholarships separately. Click the link above for more information.",
    "deadline": null,
    "limit": 0,
    "active": true
  }
]